examples/render_all_grammars/dot/tests_functional_test_import_importoverride_second.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


34734088 -> 35289624[arrowtail=diamond, dir=both, headlabel="second 1..*"]
34734088[ label="{Second|}"]

35481112[ label="{ID|}"]

34957864[ label="{STRING|}"]

35674776[ label="{BOOL|}"]

35691624[ label="{INT|}"]

35717848[ label="{FLOAT|}"]

35729976[ label="{STRICTFLOAT|}"]

35745528[ label="{NUMBER|}"]
35745528 -> 35729976 [dir=back]
35745528 -> 35691624 [dir=back]

35642344[ label="{BASETYPE|}"]
35642344 -> 35745528 [dir=back]
35642344 -> 35717848 [dir=back]
35642344 -> 35674776 [dir=back]
35642344 -> 35481112 [dir=back]
35642344 -> 34957864 [dir=back]

34823688[ label="{*OBJECT|}"]
34823688 -> 35642344 [dir=back]

35289624[ label="{Third|+t:INT\l}"]


}
